def max_integer(arg1: int, arg2: int, arg3: int):
    result = max([arg1, arg2, arg3])
    return result


print(max_integer(5, 14, 2))


'''
Написать функцию которая будет принимать 3 аргумента (int) и находить максимум из них 
'''
